Repository: xperseguers/mfa_frontend
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: da, el, es, fi, fr, it, ja, nl, no, pt

# otp
source: One-time password
da: Engangs adgangskode
el: Κωδικός πρόσβασης μίας χρήσης
es: Contraseña de un solo uso
fi: Kertakäyttösalasana
fr: Mot de passe à usage unique
it: Password unica
ja: ワンタイムパスワード
nl: Eenmalig wachtwoord
no: Engangspassord
pt: Palavra-passe única

# backend.disableAuthenticator
source: To disable the Two-Factor Authentication, toggle the switch above off and enter a valid one-time password.
da: For at deaktivere to-faktor autentificering, skal du slå switchen ovenfor fra og indtaste en gyldig engangskode.
el: Για να απενεργοποιήσετε τον έλεγχο ταυτότητας δύο παραγόντων, απενεργοποιήστε τον παραπάνω διακόπτη και πληκτρολογήστε έναν έγκυρο κωδικό πρόσβασης μίας χρήσης.
es: Para desactivar la autenticación de dos factores, desactive el interruptor anterior e introduzca una contraseña válida de un solo uso.
fi: Jos haluat poistaa kaksitekijätodennuksen käytöstä, kytke yllä oleva kytkin pois päältä ja anna voimassa oleva kertakäyttösalasana.
fr: Pour désactiver l'authentification à deux facteurs, désactivez le commutateur ci-dessus et entrez un mot de passe à usage unique valide.
it: Per disattivare l'Autenticazione a due fattori, spegnere l'interruttore di cui sopra e inserire una password unica valida.
ja: 二要素認証を無効にするには、上記のスイッチをオフに切り替え、有効なワンタイムパスワードを入力します。
nl: Om de Authenticatie met twee factoren uit te schakelen, schakelt u de bovenstaande schakelaar uit en voert u een geldig eenmalig wachtwoord in.
no: Hvis du vil deaktivere tofaktorautentisering, slår du av bryteren ovenfor og skriver inn et gyldig engangspassord.
pt: Para desativar a autenticação de dois factores, desactive o interrutor acima e introduza uma palavra-passe de uso único válida.

# totp.step1
source: Step 1
el: Βήμα 1
es: Paso 1
fi: Vaihe 1
fr: Étape 1
ja: ステップ1
nl: Stap 1
no: Trinn 1
pt: Passo 1

# totp.step2
source: Step 2
el: Βήμα 2
es: Paso 2
fi: Vaihe 2
fr: Étape 2
ja: ステップ2
nl: Stap 2
no: Trinn 2
pt: Passo 2

# totp.step3
source: Step 3
el: Βήμα 3
es: Paso 3
fi: Vaihe 3
fr: Étape 3
ja: ステップ3
nl: Stap 3
no: Trinn 3
pt: Passo 3

# totp.step1.title
source: Scan the displayed QR code
el: Σαρώστε τον εμφανιζόμενο κωδικό QR
es: Escanee el código QR mostrado
fi: Skannaa näytetty QR-koodi
fr: Scannez le code QR affiché
ja: 表示されたQRコードを読み取る
nl: Scan de weergegeven QR-code
no: Skann den viste QR-koden
pt: Digitalizar o código QR apresentado

# totp.step1.body
source: Scan this code with your OTP application (e.g., Google Authenticator).
el: Σαρώστε αυτόν τον κωδικό με την εφαρμογή OTP (π.χ. Google Authenticator).
es: Escanee este código con su aplicación OTP (por ejemplo, Google Authenticator).
fi: Skannaa tämä koodi OTP-sovelluksella (esim. Google Authenticator).
fr: Scannez ce code avec votre application OTP (p. ex. Google Authenticator).
ja: このコードをOTPアプリケーション（Google Authenticatorなど）でスキャンします。
nl: Scan deze code met de OTP-toepassing (bijvoorbeeld Google Authenticator).
no: Skann denne koden med OTP-programmet ditt (f.eks. Google Authenticator).
pt: Digitalize este código com a sua aplicação OTP (por exemplo, Google Authenticator).

# totp.step2.title
source: Copy the shared secret
el: Αντιγράψτε το κοινόχρηστο μυστικό
es: Copia el secreto compartido
fi: Kopioi jaettu salaisuus
fr: Copiez le secret partagé
ja: 共有秘密をコピーする
nl: Kopieer het gedeelde geheim
no: Kopier den delte hemmeligheten
pt: Copiar o segredo partilhado

# totp.step2.body
source: You can also enter the shared secret manually in your OTP application or device.
el: Μπορείτε επίσης να εισαγάγετε το κοινόχρηστο μυστικό χειροκίνητα στην εφαρμογή ή τη συσκευή σας OTP.
es: También puedes introducir el secreto compartido manualmente en tu aplicación o dispositivo OTP.
fi: Voit myös syöttää jaetun salaisuuden manuaalisesti OTP-sovellukseen tai laitteeseen.
fr: Vous pouvez également saisir le secret partagé manuellement dans votre application ou appareil OTP.
ja: 共有シークレットは、OTPアプリケーションまたはデバイスに手動で入力することもできます。
nl: U kunt ook het gedeelde geheim handmatig invoeren in de OTP-toepassing of -apparaat.
no: Du kan også angi den delte hemmeligheten manuelt i OTP-applikasjonen eller på enheten.
pt: Também pode introduzir o segredo partilhado manualmente na sua aplicação ou dispositivo OTP.

# totp.step3.title
source: Enter the generated six-digit code
el: Εισάγετε τον εξαψήφιο κωδικό που δημιουργήθηκε
es: Introduzca el código de seis dígitos generado
fi: Syötä luotu kuusinumeroinen koodi
fr: Saisissez le code à six chiffres généré
ja: 生成された6桁のコードを入力
nl: Voer de gegenereerde zescijferige code in
no: Skriv inn den genererte sekssifrede koden
pt: Introduzir o código de seis dígitos gerado

# totp.step3.body
source: This code should now be displayed on your device or in your application.
el: Αυτός ο κώδικας θα πρέπει τώρα να εμφανίζεται στη συσκευή σας ή στην εφαρμογή σας.
es: Este código debería aparecer ahora en tu dispositivo o en tu aplicación.
fi: Tämän koodin pitäisi nyt näkyä laitteessa tai sovelluksessa.
fr: Ce code devrait maintenant s'afficher sur votre appareil ou dans votre application.
ja: このコードは、デバイスまたはアプリケーションに表示されるはずです。
nl: Deze code moet nu worden weergegeven op het apparaat of in de applicatie.
no: Denne koden skal nå vises på enheten eller i applikasjonen.
pt: Este código deve agora ser apresentado no seu dispositivo ou na sua aplicação.

# disable2FA
source: To disable the Two-Factor Authentication, enter a valid one-time password and click the DISABLE button.
da: For at deaktivere to-faktor autentificering, skal du indtaste en gyldig engangs adgangskode og klikke på DEAKTIVÉR knappen.
el: Για να απενεργοποιήσετε τον έλεγχο ταυτότητας δύο παραγόντων, εισαγάγετε έναν έγκυρο κωδικό πρόσβασης μίας χρήσης και κάντε κλικ στο κουμπί ΑΠΕΝΕΡΓΟΠΟΙΗΣΗ.
es: Para desactivar la autenticación de dos factores, introduzca una contraseña válida de un solo uso y haga clic en el botón DESACTIVAR.
fi: Jos haluat poistaa kaksitekijätodennuksen käytöstä, anna voimassa oleva kertakäyttösalasana ja napsauta Poista käytöstä -painiketta.
fr: Pour désactiver l'authentification à deux facteurs, entrez un mot de passe valide à usage unique et cliquez sur le bouton DÉSACTIVER.
it: Per disattivare l'Autenticazione a due fattori, immettere una password unica valida e fare clic sul pulsante DISATTIVA.
ja: 二要素認証を無効にするには、有効なワンタイムパスワードを入力し、「無効」ボタンをクリックします。
nl: Om de Authenticatie met twee factoren uit te schakelen, voert u een geldig eenmalig wachtwoord in en klikt u op de knop UITSCHAKELEN.
no: Hvis du vil deaktivere tofaktorautentisering, skriver du inn et gyldig engangspassord og klikker på knappen DEAKTIVER.
pt: Para desativar a autenticação de dois factores, introduza uma palavra-passe única válida e clique no botão DESATIVAR.

# success.title
source: Success!
da: Succes!
el: Επιτυχία!
es: ¡Éxito!
fi: Menestys!
fr: Opération réussie !
it: Successo!
nl: Succes!
no: Suksess!
pt: Sucesso!

# success.enable.body
source: Your account is now protected by a two-factor authentication.
da: Din konto er nu beskyttet af en to-faktor godkendelse.
el: Ο λογαριασμός σας προστατεύεται πλέον με έλεγχο ταυτότητας δύο παραγόντων.
es: Tu cuenta está ahora protegida por una autenticación de dos factores.
fi: Tilisi on nyt suojattu kaksitekijätodennuksella.
fr: Votre compte est maintenant protégé par une authentification à deux facteurs.
it: Il vostro account è ora protetto da un'autenticazione a due fattori.
ja: アカウントは二要素認証で保護されます。
nl: Je account is nu beveiligd met een twee-factor authenticatie.
no: Kontoen din er nå beskyttet av en tofaktorautentisering.
pt: A sua conta está agora protegida por uma autenticação de dois factores.

# success.disable.body
source: You disabled the two-factor authentication for your account.
da: Du har deaktiveret tofaktorgodkendelse for din konto.
el: Απενεργοποιήσατε τον έλεγχο ταυτότητας δύο παραγόντων για το λογαριασμό σας.
es: Has desactivado la autenticación de dos factores para tu cuenta.
fi: Olet poistanut tilisi kaksitekijätodennuksen käytöstä.
fr: Vous avez désactivé l'authentification à deux facteurs pour votre compte.
it: Avete disattivato l'autenticazione a due fattori per il vostro account.
ja: アカウントの2ファクタ認証を無効にしました。
nl: Je hebt de tweefactorauthenticatie voor je account uitgeschakeld.
no: Du har deaktivert tofaktorautentiseringen for kontoen din.
pt: Desactivou a autenticação de dois factores da sua conta.

# action.enable
source: Enable
da: Aktivér
el: Ενεργοποίηση
es: Activar
fi: Ota käyttöön
fr: Activer
it: Attiva
nl: Inschakelen
no: Aktivere
pt: Ativar

# action.disable
source: Disable
da: Deaktivér
el: Απενεργοποίηση
es: Desactivar
fi: Pois käytöstä
fr: Désactiver
it: Disattiva
nl: Uitschakelen
no: Deaktivere
pt: Desativar

# validator.secret.tampered
source: The generated secret is invalid or has been tampered with.
fi: Generoitu salaisuus on virheellinen tai sitä on peukaloitu.
ja: 生成された秘密が無効であるか、改ざんされている。
nl: De gegenereerde secret is ongeldig of er is mee geknoeid.

# validator.otp.notvalid
source: The given one-time password is invalid or has expired.
da: Den angivne engangs adgangskode er ugyldig eller er udløbet.
el: Ο δοθείς κωδικός πρόσβασης μιας χρήσης είναι άκυρος ή έχει λήξει.
es: La contraseña de un solo uso indicada no es válida o ha caducado.
fi: Annettu kertakäyttösalasana on virheellinen tai vanhentunut.
fr: Le mot de passe unique donné est invalide ou a expiré.
it: La password unica fornita non è valida o è scaduta.
ja: 指定されたワンタイムパスワードが無効であるか、有効期限が切れています。
nl: Het opgegeven eenmalige wachtwoord is ongeldig of verlopen.
no: Det angitte engangspassordet er ugyldig eller utløpt.
pt: A palavra-passe de uso único fornecida é inválida ou expirou.

# qrImage
source: Google Authenticator QR-Code
da: Google Authenticator QR-kode
fr: Code QR Google Authenticator
it: Codice QR di Google Authenticator

source: Secret
it: Segreto

# totp.step1.title
source: Scan the QR code
da: Skan QR-koden
it: Scansionare del codice QR

# totp.step1.body
source: Scan the QR code below in the authenticator application.
da: Scan QR-koden nedenfor i autentificeringsapplikationen.
it: Scansionare il codice QR qui sotto nell'applicazione Authenticator.

# totp.step2.title
source: Keep the secret in a safe place
da: Opbevar din secret på et sikkert sted
it: Conservare il segreto in un luogo sicuro

# totp.step2.body
source: You will need this code if you ever have to recover your authenticator.
da: Du skal bruge denne kode, hvis du på et tidspunkt skal gendanne din autentificering.
it: Questo codice è necessario in caso di recupero dell'autenticatore.

# totp.step3.title
source: Enter the verification code
da: Indtast bekræftelseskoden
it: Inserire il codice di verifica

# totp.step3.body
source: Once you have scanned the QR code, enter the 6-digit verification code generated by the authenticator application.
da: Når du har scannet QR-koden, skal du indtaste den 6-cifrede bekræftelseskode, der er genereret af autentificeringsprogrammet.
it: Una volta scansionato il codice QR, inserire il codice di verifica a 6 cifre generato dall'applicazione authenticator.
